       identification division.
      * THIS PROGRAM READ A FILE AND CALCULATES A TOTAL SALES NUMBER OF
      *PIZZA AND GENRATES A REPORT.
       program-id. CBLNMA01.
       AUTHOR. NATNAIL ALAMNEH.

       environment division.
           SELECT PIZZA-MASTER
               ASSIGN TO 'C:\COBOLWI19\CBLPIZZA.DAT'
                   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRTOUT
               ASSIGN TO 'C:\COBOLWI19\PIZZARPT.PRT'
                   ORGANIZATION IS RECORD SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD PIZZA-MASTER
           LABEL RECORD IS STANDARD
           DATA RECORD IS I-REC
           RECORD CONTAINS 40 CHARACTERS.

       01 PIZZA-REC.
         05 PIZZA-ITEM-NO.
           10 PIZZA-ITEM-NO-1 PIC X.
           10 PIZZA-ITEM-NO-1 PIC X.
           10 PIZZA-ITEM-NO-1 PIC XX.
         05 PIZZA-CUR-DATE.
           10 PIZZA-CUR-YY PIC 9(4).
           10 PIZZA-CUR-MM PIC 99.
           10 PIZZA-CUR-DD PIC 99.
         05 PIZZA-PRICE PIC 99V99.
         05 PIZZA-CUR-QTY PIC 9(5).
         05 PIZZA-PREV-QTY PIC 9(5).


       FD PRTOUT
           LABEL RECORD IS OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRTLINE
           LINAGE IS 60 WITH FOOTING AT 56.
       01 PRTLINE PIC X(132).

       WORKING-STORAGE SECTION.
       01 MISC.
         05 MORE-RECS PIC X(3) VALUE 'YES'.
         05 PAGE-CTR PIC 99 VALUE 0.
         05 C-SALES-INCDEC PIC 9(5) VALUE 0.
         05 C-INCDEC-PERC PIC 9(4)V99 VALUE 0.
         05 C-TOTAL-SALES PIC 9(5) VALUE 0.
         05 C-PIZZA-CUR-QTY PIC 9(5) VALUE 0.
         05 C-PIZZA-PREV-QTY PIC 9(5) VALUE 0.
         05 C-PIZZA-PRICE PIC 99V99 VALUE 0.
         05 C-AVG-INCDEC-AMT PIC 99V999 VALUE 0.
         05 C-AVG-INCDEC-PERC-AMT PIC 9(4) VALUE 0.
         05 C-TOTAL-SALES-TOTAL PIC 9(5) VALUE 0.
         05 C-SALES-INCDEC-TOTAL PIC 9(5) VALUE 0.
         05 C-ITEM-NUMBER PIC 9(6) VALUE 0.
         05 C-PREV-QTY-TOTAL PIC 9(5) VALUE 0.
         05 CURRENT-DATE-AND-TIME.
           10 CURRENT-YEAR PIC X(4).
           10 CURRENT-MOUNTH PIC XX.
           10 CURRENT-DAY PIC XX.
           10 CURRENT-TIME PIC X(11).

       01 TITLE-LINE.
         05 FILLER PIC X(6) VALUE 'DATE: '.
         05 TITLE-DATE.
           10 TITLE-MONTH PIC XX.
           10 FILLER PIC X VALUE '/'.
           10 TITLE-DAY PIC XX.
           10 FILLER PIC X VALUE '/'.
           10 TITLE-YEAR PIC X(4).
         05 FILLER PIC X(39) VALUE SPACE.
         05 FILLER PIC X(22) VALUE 'NATNAILS MONTHLY SALES'.
         05 FILLER PIC X(47) VALUE SPACES.
         05 FILLER PIC X(6) VALUE 'PAGE: '.
         05 TITLE-PAGE PIC Z9.

       01 COL-HEADING1.
         05 FILLER PIC X(5) VALUE SPACES.
         05 FILLER PIC X(4) VALUE 'ITEM'.
         05 FILLER PIC X(23) VALUE SPACES.
         05 FILLER PIC X(5) VALUE 'PRIOR'.
         05 FILLER PIC X(7) VALUE SPACES.
         05 FILLER PIC X(7) VALUE 'CURRENT'.
         05 FILLER PIC X(9) VALUE SPACES.
         05 FILLER PIC X(14) VALUE 'SALES INCREAS'.
         05 FILLER PIC X(8) VALUE SPACES.
         05 FILLER PIC X(9) VALUE 'INCR/DECR'.
         05 FILLER PIC X(10) VALUE SPACES.
         05 FILLER PIC X(5) VALUE 'SALES'.
         05 FILLER PIC X(27) VALUE SPACES.

       01 COL-HEADING2.
         05 FILLER PIC X(4) VALUE SPACE.
         05 FILLER PIC X(6) VALUE 'NUMBER'.
         05 FILLER PIC X(4) VALUE SPACE.
         05 FILLER PIC X(10) VALUE 'SALES DATE'.
         05 FILLER PIC X(9) VALUE SPACE.
         05 FILLER PIC XXX VALUE 'QTY'.
         05 FILLER PIC X(10) VALUE SPACE.
         05 FILLER PIC XXX VALUE 'QTY'.
         05 FILLER PIC X(11) VALUE SPACE.
         05 FILLER PIC X(13) VALUE '/DECREASE AMT'.
         05 FILLER PIC X(8) VALUE SPACE.
         05 FILLER PIC X(5) VALUE 'PRICE'.
         05 FILLER PIC X(10) VALUE SPACE.
         05 FILLER PIC X(11) VALUE 'TOTAL SALES'.
         05 FILLER PIC X(6) VALUE SPACE.

       01 DETAIL-LINE.
         05 FILLER PIC X(4) VALUE SPACE.
         05 D-ITEM-NUMBER PIC X(6).
         05 FILLER PIC X(4) VALUE SPACE.
         05 D-SALES-DATE PIC X(10).
         05 FILLER PIC X(7) VALUE SPACE.
         05 D-PIROR-QTY PIC $ZZ,ZZ9.
         05 FILLER PIC X(12) VALUE SPACE.
         05 D-CURRENT-QTY PIC ZZ,ZZ9.
         05 FILLER PIC X(9) VALUE SPACE.
         05 D-SALES-INDEC PIC ZZ,ZZ9.
         05 FILLER PIC X(8) VALUE SPACE.
         05 D-INCDEC-PERC PIC ZZ,ZZ9.99B-.
         05 FILLER PIC X(7) VALUE SPACE.
         05 D-SALES-PRICE PIC ZZ,ZZ9.
         05 FILLER PIC X(7) VALUE SPACE.
         05 D-TOTAL-SALES PIC $$$,$$$,$$$,99.
         05 FILLER PIC X(6) VALUE SPACE.

       01 TOTAL-LINE.
         05 FILLER PIC X(45) VALUE SPACE.
         05 FILLER PIC X(15) VALUE 'GRAND TOTAL: '.
         05 T-GRAND-TOTAL PIC Z,ZZZ,ZZ9.
         05 FILLER PIC X(38) VALUE SPACE.
         05 TOTAL-SALES PIC $$,$$$,$$$,99.
         05 FILLER PIC X(6) VALUE SPACE.

       01 AVERAGE-LINE.
         05 FILLER PIC X(25) VALUE SPACE.
         05 AVG-DECINC-AMT PIC X(39) VALUE
                           'AVERAGE INCREASE/DECREASE AMOUNT:'.

         05 AVG-INCR-SALES-AMT PIC Z,ZZ,ZZ9.
         05 FILLER PIC X(6) VALUE SPACE.

       01 PERSENTAGE-LINE.
         05 AVG-INCDEC-PERCENTAGE PIC X(44) VALUE SPACES.
         05 FILLER PIC X(37) VALUE
                   'AVERAGE INCREASE/DECREASE PERCENTAGE:'.
         05 PERCENTAGE-SALES-INCR-DEC-AMT PIC 9V99.
         05 FILLER PIC X(6) VALUE SPACE.

       PROCEDURE DIVISION.
      *PROCEDURE DIVISION CONTAINS ALL OF THE LOGIC OF PROGRAM
       L1-MAIN.
           PERFORM L2-INIT.
           PERFORM L2-MAINLINE
             UNTIL MORE-RECS = "NO".
           PERFORM L2-CLOSING.
           STOP RUN.

       L2-INIT.
           OPEN INPUT PIZZA-MASTER.
           OPEN OUTPUT PRTOUT.
           MOVE FUNCTION CURRENT-DATE TO CURRENT-DATE-AND-TIME.
           MOVE CURRENT-MOUNTH TO TITLE-MONTH.
           MOVE CURRENT-DAY TO TITLE-DAY.
           MOVE CURRENT-YEAR TO TITLE-YEAR.
           PERFORM L4-HEADING.
           PERFORM L3-READ-INPUT.

       L2-MAINLINE.
           PERFORM L3-CALCS.
           PERFORM L3-MOVE-PRINT.
           PERFORM L3-READ-INPUT.

       L2-CLOSING.
           PERFORM L3-TOTALS.
           CLOSE PIZZA-MASTER.
           CLOSE PRTOUT.

       L3-CALCS.
           COMPUTE C-SALES-INCDEC = C-PIZZA-CUR-QTY - C-PIZZA-PREV-QTY.
           COMPUTE C-INCDEC-PERC = C-SALES-INCDEC / PIZZA-PREV-QTY.
           COMPUTE C-TOTAL-SALES = PIZZA-PRICE * PIZZA-CUR-QTY.
           COMPUTE C-TOTAL-SALES-TOTAL = C-TOTAL-SALES-TOTAL +
             C-TOTAL-SALES.
           COMPUTE C-SALES-INCDEC-TOTAL = C-SALES-INCDEC-TOTAL +
             C-SALES-INCDEC.
           COMPUTE C-ITEM-NUMBER = C-ITEM-NUMBER + 1
           COMPUTE C-PREV-QTY-TOTAL = C-PREV-QTY-TOTAL + PIZZA-PREV-QTY.
           COMPUTE C-AVG-INCDEC-AMT = C-SALES-INCDEC-TOTAL /
             C-ITEM-NUMBER.
           COMPUTE C-AVG-INCDEC-PERC-AMT = C-SALES-INCDEC-TOTAL /
             C-PREV-QTY-TOTAL.

       L3-MOVE-PRINT.
           MOVE PIZZA-ITEM-NO TO D-ITEM-NUMBER.
           MOVE PIZZA-CUR-DATE TO D-SALES-DATE.
           MOVE PIZZA-PRICE TO D-SALES-PRICE.
           MOVE PIZZA-CUR-QTY TO D-CURRENT-QTY.
           MOVE PIZZA-PREV-QTY TO D-PIROR-QTY.
           MOVE PIZZA-CUR-DATE TO D-SALES-INDEC.
           MOVE PIZZA-PRICE TO D-TOTAL-SALES.


           WRITE PRTLINE FROM DETAIL-LINE
             AFTER ADVANCING 3 LINES
               AT EOP
                   PERFORM L4-HEADING.

       L3-READ-INPUT.
           READ PIZZA-MASTER
               AT END
                   MOVE 'NO' TO MORE-RECS.
       L3-TOTALS.
           MOVE C-SALES-INCDEC TO C-TOTAL-SALES.
           WRITE PRTLINE FROM TOTAL-LINE
             AFTER ADVANCING 3 LINES.

       L4-HEADING.
           ADD 1 TO PAGE-CTR.
           MOVE PAGE-CTR TO TITLE-PAGE.
           WRITE PRTLINE FROM TITLE-LINE
             AFTER ADVANCING PAGE.
           WRITE PRTLINE FROM COL-HEADING1
             AFTER ADVANCING 2 LINES.
           WRITE PRTLINE FROM COL-HEADING2
             AFTER ADVANCING 1 LINE.

       end program CBLNMA01.